Revit 2024 API
FabricSheet.PlaceInHost Method
 Inserts the single Fabric Sheet instance into the host element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public void PlaceInHost(
	Element hostElement,
	Transform transform
)
Visual Basic
Public Sub PlaceInHost ( _
	hostElement As Element, _
	transform As Transform _
)
Visual C++
public:
void PlaceInHost(
	Element^ hostElement,
	Transform^ transform
)
Parameters
hostElement
Type: Autodesk.Revit.DB.Element
 A structural element that will host the Fabric Sheet. The element must support fabric hosting.
transform
Type: Autodesk.Revit.DB.Transform
 The transform that defines the placement of the instance single Fabric Sheet.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The host Element is not a valid host for Fabric Sheet. -or- transform defines the placement out of the host.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  transform is not conformal.
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace